#include <iostream>

using namespace std;
int main() {
    setlocale(LC_ALL, "Russian");
    int  b, d, m, n, sw, o;
    char a, c;
start:
    cout << "\nВведите номер задания: ";
    cin >> sw;
    switch (sw) {
    case 1: {
        string massive[] = { "zero", "Первое", "Второе", "Третье", "Четвертое", "Пятое", "Шестое", "Седьмое", "Восьмое",
                            "Девятое", "Десятое", "Одиннадцатое", "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое",
                            "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое", "Двадцатое", "Двадцать первое",
                            "Двадцать второе", "Двадцать третье", "Двадцать четвертое", "Двадцать пятое", "Двадцать шестое",
                            "Двадцать седьмое", "Двадцать восьмое", "Двадцать девятое", "Тридцатое", "Тридцать первое" };
        string massive2[] = { "zero", "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа",
                             "сентября",
                             "октября", "ноября", "декабря" };
        cout << "Введите дату" << endl << "День: ";
        cin >> d;
        cout << "Месяц: ";
        cin >> m;
        if (d == 31 and (m == 2) || d == 31 and (m == 4) || d == 31 and (m == 6) || d == 31 and (m == 9) ||
            d == 31 and (m == 11) || d > 29 and (m == 2)) {
            cout << " Такой даты не существует " << endl;
        }
        else {
            cout << massive[d] << " " << massive2[m] << endl;
        }
        goto start;
    }
    case 2: {

        char a;

        cout << "Выберите точку откуда вы будете начинать(N - Север, W - Запад,  S - Юг, E - восток): ";
        cin >> a;

        if (a == 'N') {
            int b;
            cout
                << "Вы начали с Севера, выберите дальнейшее направление (0 — продолжать движение, 1 — поворот налево, -1 — поворот направо): ";
            cin >> b;
            if (b == 0)
                cout << "Вы попали на Юг";
            if (b == 1)
                cout << "Вы попали на Восток";
            if (b == -1)
                cout << "Вы попали на Запад";

        }

        if (a == 'W') {
            int b;
            cout
                << "Вы начали с Запада, выберите дальнейшее направление (0 — продолжать движение, 1 — поворот налево, -1 — поворот направо): ";
            cin >> b;
            if (b == 0)
                cout << "Вы попали на Восток";
            if (b == 1)
                cout << "Вы попали на Север";
            if (b == -1)
                cout << "Вы попали на Юг";

        }

        if (a == 'S') {
            int b;
            cout
                << "Вы начали с Юга, выберите дальнейшее направление (0 — продолжать движение, 1 — поворот налево, -1 — поворот направо): ";
            cin >> b;
            if (b == 0)
                cout << "Вы попали на Север";
            if (b == 1)
                cout << "Вы попали на Запад";
            if (b == -1)
                cout << "Вы попали на Восток";

        }

        if (a == 'E') {
            int b;
            cout
                << "Вы начали с Востока, выберите дальнейшее направление (0 — продолжать движение, 1 — поворот налево, -1 — поворот направо): ";
            cin >> b;
            if (b == 0)
                cout << "Вы попали на Запад";
            if (b == 1)
                cout << "Вы попали на Юг";
            if (b == -1)
                cout << "Вы попали на Север";

        }
        goto start;
    }
    case 3: {
        cout << "Введите кол-во уч. заданий (от 10 до 40): ";
        cin >> n;
        string massiv[] = { "Десять", "Одиннадцать","Двенвдцать","Тринадцать", "Четырнадцать", "Пятнадцать","Шестнадцать","Семнадцать", "Восемнадцать", "Девятнадцать", "Двадцать" };
        string massi[] = { "","одно", "два","три","четыре", "пять", "шесть","семь","восемь", "девять", };
        string massivv[] = { "","","Двадцать", "Тридцать","Сорок" };

        if (n >= 10 && n <= 20) {
            cout << massiv[n - 10] << " учебных заданий";
        }
        else if ((n > 20 && n <= 24) && (n != 21)) {
            cout << "Двадцать" << massi[(n % 10)] << " учебных задания";
        }
        else if (n >= 25 && n < 30) {
            cout << "Двадцать" << massi[(n % 10)] << " учебных заданий";
        }
        else if ((n >= 30 && n <= 34) && (n != 31)) {
            cout << "Тридцать" << massi[(n % 10)] << " учебных задания";
        }
        else if ((n > 34 && n < 40) && (n != 31)) {
            cout << "Тридцать " << massi[(n % 10)] << " учебных заданий";
        }
        else if (n % 10 == 1) {
            cout << massivv[(n / 10) % 10] << " одно учебное задание";
        }
        else if (n == 40) {
            cout << "Сорок учебных заданий";
        }
        goto start;
    }
    case 4: {
        cout << "Введите число: ";
        cin >> n;
        string mas0[] = { "десять", "одиннадцать","двенвдцать","тринадцать", "четырнадцать", "пятнадцать","шестнадцать","семнадцать", "восемнадцать", "девятнадцать", "двадцать" };
        string mas1[] = { " ","Сто", "Двести" , "Триста", "Четыреста", "Пятьсот", "Шестьсот", "Семьсот", "Восемьсот", "Девятьсот" };
        string mas2[] = { "двадцать","тридцать", "сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто" };
        string mas3[] = { " ","один","два","три","четыре","пять","шесть","семь","восемь","девять" };
        if ((n % 100 != 10) || (n % 100 != 11) || (n % 100 != 12) || (n % 100 != 13) || (n % 100 != 14) || (n % 100 != 15) || (n % 100 != 16) || (n % 100 != 17) || (n % 100 != 18) || (n % 100 != 19)) {
            cout << mas1[n / 100] << " " << mas2[((n / 10) % 10) - 2] << " " << mas3[n % 10];
        }
        else if ((n > 109) && (n <= 119)) {
            cout << mas1[(n / 100) % 10] << " " << mas0[n % 10];
        }
        goto start;
        }
    case 5: {
      
        
        cout << "Год:";
        cin >> n;

        cout << "Год ";

        switch ((n) % 10) {
        case 0:
        case 1:
            cout << "бел";
            break;
        case 2:
        case 3:
            cout << "черн";
            break;
        case 4:
        case 5:
            cout << "зелён";
            break;
        case 6:
        case 7:
            cout << "красн";
            break;
        case 8:
        case 9:
            cout << "жёлт";
            break;
        }


        switch ((n + 8) % 12) {
        case 0:
            cout << "ой крысы";
            break;
        case 1:
            cout << "ой коровы";
            break;
        case 2:
            cout << "ого тигра";
            break;
        case 3:
            cout << "ого зайца";
            break;
        case 4:
            cout << "ого дракона";
            break;
        case 5:
            cout << "ой змеи";
            break;
        case 6:
            cout << "ой лошади";
            break;
        case 7:
            cout << "ой овцы";
            break;
        case 8:
            cout << "ой обезьяны";
            break;
        case 9:
            cout << "ой курицы";
            break;
        case 10:
            cout << "ой собаки";
            break;
        case 11:
            cout << "ой свиньи";
            break;
        }

        goto start;
    }
    default: {
        cout << "Такого задания нет, введите число от 1-4\n";
        goto start;
    }
    }

    }
